x = int("введите первое число")
num_2 = int(input("введите второе число:'))
print(x-y)
#пользователь вводит с клавиатуры 3 числа. необходимо найти сумму чисел,
#найти произведение чисел, найти разность чисел, найти деление чисел.
# результат вычислений операций вывести на экран.


                  #print("сегодня 5 сетября", "я измученная пришла на первую пару", "к 8:15",
#sep ='\t', end=' '
 #     )
# \t -текстовая табуляция(3 пробела)
# \n - перенос на новую строку
# sep - отступы между параметрами print
# end - завершение строки

# #print('желаю \'всем\' продуктивного дня')
# name = input("введите имя:")
# s_name =input("введите фамилию:")
# age = int(input("введите ваш возраст:"))
# date = input("введите ваш год рождения:")
# print(f"ваше имя: {name} \n"
# f"ваша фамилия: {s_name} \n"
# f"ваш возраст: {age} \n"
# f"ваша дата рождения: {date} \n")
# обращение f'' f"" f`` нужно для форматирования
# текста и вставки переменных в строку
'''
# арифметические операции в python
# + - \ * ( )
# ** - оператор возведения в степень
# print(2**2) #4
# // - целочисленное деление
# print(6.31// 3) # 2
# % - деление по остатку
# print(6 % 2) # 0
# 1.делить на 0 нельзя!
# 2.делить целое число на 0!
# 3.находить остаток от деления на 0!
# функция суммы: sum(1, 2, 3)#6
# функция минимума:min(1, 2, 3)#1
# функция максимума:max(1, 2, 3)#3
# '''
# #практика
# '''
#  #  практика пользователь вводит с клавиатуры три числа
#  #  первое число - зп в месяц
#  #  второе число - сумма месячного платежа по кредиту в банке
#  #  третье число -  задолженность за комм услуги
#  #  необходимо вывести на экран сумму,
#  # которая останется у пользователя после всех выплат

'''
# num_1= int(input("введите первую длину"))
# num_2 = int(input("введите вторую длину"))
# num_3 = int(input("введите третью длину"))
# result = sum (num_1 +num_2)
# print('ответ')

age= int(input('введите возраст:'))
# if (условие) == true:
# ффункция действие
# if 0< age < 10:
#     print("ты еще мини")
# if age < 20 and age >10:
#     print("ты еще мини")
# if age < 30:
#     print("ты еще мини")
# if age < 40:
#     print("ты еще мини")
#     if age < 50:
#     print("ты еще мини")
#         if age < 60:
#     print("ты еще мини")
#             if age < 70:
#     print("ты еще мини")
#                 if age < 80:
#     print("ты еще мини")
#                     if age < 90:
#     print("ты еще мини")
#                         if age < 100:
#     print("ты еще мини")
# else:
#     print("ну ты и старик")

# пользователь вводит с клавиатуры три числа.
# в зависимости от выбора пользователя программа выводит на
# экран сумму трех чисел или произведение трех чисел.
